# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs, fixed to YOLOv8n scale

nc: 1 # Number of classes from global_config

# YOLOv8n backbone
backbone:
  - [-1, 1, Conv, [16, 3, 2]]  # 64 * 0.25 = 16
  - [-1, 1, Conv, [32, 3, 2]]  # 128 * 0.25 = 32
  - [-1, 1, C2f, [32, True]]  # min(128 * 0.25, 1024) = 32
  - [-1, 1, Conv, [64, 3, 2]]  # 256 * 0.25 = 64
  - [-1, 2, C2f, [64, True]]  # int(6 * 0.33) = 2; min(256 * 0.25, 1024) = 64
  - [-1, 1, Conv, [128, 3, 2]]  # 512 * 0.25 = 128
  - [-1, 2, C2f, [128, True]]  # min(512 * 0.25, 1024) = 128
  - [-1, 1, Conv, [256, 3, 2]]  # min(1024 * 0.25, 1024) = 256
  - [-1, 1, C2f, [256, True]]
  - [-1, 1, SPPF, [256, 5]]

# YOLOv8n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]          
  - [-1, 1, C2f, [128]]                

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]          
  - [-1, 1, C2f, [64]]                 # P3/8-small

  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]         
  - [-1, 1, C2f, [128]]                # P4/16-medium

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]          
  - [-1, 1, C2f, [256]]                # P5/32-large

  - [[13, 16, 19], 1, Detect, [nc]]    